In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Combined_DS_v10.csv')
df.head()

,SurveyDate,FormalEducation,ConvertedSalary,Hobby,Country,StackOverflowJobsRecommend,VersionControl,Age,Years Experience,Gender,RawSalary
0,2/28/18 20:20,Bachelor's degree (BA. BS. B.Eng.. etc.),NaN,Yes,South Africa,NaN,Git,21,13,Male,NaN
1,6/28/18 13:26,Bachelor's degree (BA. BS. B.Eng.. etc.),70841.0,Yes,Sweeden,7.0,Git;Subversion,38,9,Male,"70,841.00"
2,6/6/18 3:37,Bachelor's degree (BA. BS. B.Eng.. etc.),NaN,No,Sweeden,8.0,Git,45,11,NaN,NaN
3,5/9/18 1:06,Some college/university study without earning ...,21426.0,Yes,Sweeden,NaN,Zip file back-ups,46,12,Male,"21,426.00"
4,4/12/18 22:41,Bachelor's degree (BA. BS. B.Eng.. etc.),41671.0,Yes,UK,8.0,Git,39,7,Male,"£41,671.00"

In [9]:
countries = df['Country']
countries_count = df['Country'].value_counts()
countries_count

South Africa    166
USA             164
Spain           134
Sweeden         119
France          115
Russia           97
UK               95
India            95
Ukraine           9
Ireland           5
Name: Country, dtype: int64

In [10]:
countries_count[countries_count<10].index

Index(['Ukraine', 'Ireland'], dtype='object')

In [11]:
mask = countries.isin(countries_count[countries_count<10].index)
mask

0      False
1      False
2      False
3      False
4      False
       ...
994    False
995    False
996    False
997    False
998    False
Name: Country, Length: 999, dtype: bool

In [12]:
df['Country'][mask] ='Other'

C:\Users\NK\AppData\Local\Temp\ipykernel_6268\2013784232.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Country'][mask] ='Other'

In [13]:
df.head()

,SurveyDate,FormalEducation,ConvertedSalary,Hobby,Country,StackOverflowJobsRecommend,VersionControl,Age,Years Experience,Gender,RawSalary
0,2/28/18 20:20,Bachelor's degree (BA. BS. B.Eng.. etc.),NaN,Yes,South Africa,NaN,Git,21,13,Male,NaN
1,6/28/18 13:26,Bachelor's degree (BA. BS. B.Eng.. etc.),70841.0,Yes,Sweeden,7.0,Git;Subversion,38,9,Male,"70,841.00"
2,6/6/18 3:37,Bachelor's degree (BA. BS. B.Eng.. etc.),NaN,No,Sweeden,8.0,Git,45,11,NaN,NaN
3,5/9/18 1:06,Some college/university study without earning ...,21426.0,Yes,Sweeden,NaN,Zip file back-ups,46,12,Male,"21,426.00"
4,4/12/18 22:41,Bachelor's degree (BA. BS. B.Eng.. etc.),41671.0,Yes,UK,8.0,Git,39,7,Male,"£41,671.00"

In [14]:
df['Country'].value_counts()

South Africa    166
USA             164
Spain           134
Sweeden         119
France          115
Russia           97
UK               95
India            95
Other            14
Name: Country, dtype: int64

In [15]:
# tạo cột Paid_Job chỉ có 2 giá trị là 1: có trả tiền và 0: không trả tiền

In [19]:
df['Paid_Job'] = 0
df.loc[df['ConvertedSalary']>0, 'Paid_Job'] = 1

In [20]:
df[['Paid_Job','ConvertedSalary']].head()

   Paid_Job  ConvertedSalary
0         0              NaN
1         1          70841.0
2         0              NaN
3         1          21426.0
4         1          41671.0

## Binning Value

In [25]:
df['Equal_Bin'] = pd.cut(df['ConvertedSalary'], bins=5)

In [26]:
df[['Equal_Bin','ConvertedSalary']].head()

             Equal_Bin  ConvertedSalary
0                  NaN              NaN
1  (-2000.0, 400000.0]          70841.0
2                  NaN              NaN
3  (-2000.0, 400000.0]          21426.0
4  (-2000.0, 400000.0]          41671.0

In [27]:
df['Equal_Bin'].unique()

[NaN, (-2000.0, 400000.0], (800000.0, 1200000.0], (400000.0, 800000.0], (1600000.0, 2000000.0]]
Categories (5, interval[float64, right]): [(-2000.0, 400000.0] < (400000.0, 800000.0] < (800000.0, 1200000.0] < (1200000.0, 1600000.0] < (1600000.0, 2000000.0]]

In [28]:
df['Equal_Bin'].value_counts()

(-2000.0, 400000.0]       645
(800000.0, 1200000.0]       9
(400000.0, 800000.0]        6
(1600000.0, 2000000.0]      5
(1200000.0, 1600000.0]      0
Name: Equal_Bin, dtype: int64

In [29]:
df['ConvertedSalary'].min(), df['ConvertedSalary'].max()

(0.0, 2000000.0)

In [30]:
import numpy as np

In [33]:
my_bins = [-np.inf,20000,60000,100000,140000,np.inf]
my_label = ['Very low','Low','Medium','High','Very High']

In [34]:
df['Equal_Bin_2'] = pd.cut(df['ConvertedSalary'],bins=my_bins,labels=my_label)

In [35]:
df[['Equal_Bin_2','ConvertedSalary']].head(10)

  Equal_Bin_2  ConvertedSalary
0         NaN              NaN
1      Medium          70841.0
2         NaN              NaN
3         Low          21426.0
4         Low          41671.0
5        High         120000.0
6         NaN              NaN
7   Very High         250000.0
8         NaN              NaN
9    Very low              0.0